; domain
(define (domain drone)

    ;remove requirements that are not needed
    ;(:requirements :strips)

    (:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
        location - object
    )

    ; un-comment following line if constants are needed
    ;(:constants )

    (:predicates ;todo: define predicates here
        (visited ?x - location)
    )
    (:functions
        (x)
        (y)
        (z)
        (xl ?l - location)
        (yl ?l - location)
        (zl ?l - location)
        (battery-level)
        (battery-level-full)
        (min_x)
        (max_x)
        (min_y)
        (max_y)
        (min_z)
        (max_z)
    )

    (:action increase_x
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (x) (- (max_x) 1))
        )
        :effect (and (increase (x) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action decrease_x
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (x) (+ (min_x) 1))
        )
        :effect (and (decrease (x) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action increase_y
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (y) (- (max_y) 1))
        )
        :effect (and (increase (y) 1)
            (decrease (battery-level) 1)
        )
    )
    (:action decrease_y
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (y) (+ (min_y) 1))
        )
        :effect (and (decrease (y) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action increase_z
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (<= (z) (- (max_z) 1))
        )
        :effect (and (increase (z) 1)
            (decrease (battery-level) 1)
        )
    )
    (:action decrease_z
        :parameters ()
        :precondition (and
            (>= (battery-level) 1)
            (>= (z) (+ (min_z) 1))
        )
        :effect (and (decrease (z) 1)
            (decrease (battery-level) 1)
        )
    )

    (:action visit
        :parameters (?l - location)
        :precondition (and
            (>= (battery-level) 1)
            (= (xl ?l) (x))
            (= (yl ?l) (y))
            (= (zl ?l) (z))
        )
        :effect (and (visited ?l)
            (decrease (battery-level) 1))
    )

    (:action recharge
        :parameters ()
        :precondition (and
            (= (x) 0)
            (= (y) 0)
            (= (z) 0)
        )
        :effect (and
            (assign (battery-level) (battery-level-full)))
    )

)

; problem
;;Instance with 1x8x1 points
(define (problem name) (:domain drone)
(:objects
x0y0z0 - location
x0y1z0 - location
x0y2z0 - location
x0y3z0 - location
x0y4z0 - location
x0y5z0 - location
x0y6z0 - location
x0y7z0 - location
)
(:init (= (x) 0) (= (y) 0) (= (z) 0)
 (= (min_x) 0)  (= (max_x) 1)
 (= (min_y) 0)  (= (max_y) 8)
 (= (min_z) 0)  (= (max_z) 1)
(= (xl x0y0z0) 0)
(= (yl x0y0z0) 0)
(= (zl x0y0z0) 0)
(= (xl x0y1z0) 0)
(= (yl x0y1z0) 1)
(= (zl x0y1z0) 0)
(= (xl x0y2z0) 0)
(= (yl x0y2z0) 2)
(= (zl x0y2z0) 0)
(= (xl x0y3z0) 0)
(= (yl x0y3z0) 3)
(= (zl x0y3z0) 0)
(= (xl x0y4z0) 0)
(= (yl x0y4z0) 4)
(= (zl x0y4z0) 0)
(= (xl x0y5z0) 0)
(= (yl x0y5z0) 5)
(= (zl x0y5z0) 0)
(= (xl x0y6z0) 0)
(= (yl x0y6z0) 6)
(= (zl x0y6z0) 0)
(= (xl x0y7z0) 0)
(= (yl x0y7z0) 7)
(= (zl x0y7z0) 0)
(= (battery-level) 21)
(= (battery-level-full) 21)
)
(:goal (and
(visited x0y0z0)
(visited x0y1z0)
(visited x0y2z0)
(visited x0y3z0)
(visited x0y4z0)
(visited x0y5z0)
(visited x0y6z0)
(visited x0y7z0)
(= (x) 0) (= (y) 0) (= (z) 0) ))
);; end of the problem instance

; plan
1. (increase_y)
   changed: (y) from 0 to 1, (battery-level) from 21 to 20
   goals met: 2 of 11
2. (increase_y)
   changed: (y) from 1 to 2, (battery-level) from 20 to 19
   goals met: 2 of 11
3. (increase_y)
   changed: (y) from 2 to 3, (battery-level) from 19 to 18
   goals met: 2 of 11
4. (visit x0y3z0)
   added: (visited x0y3z0)
   changed: (battery-level) from 18 to 17
   goals met: 3 of 11
5. (increase_y)
   changed: (y) from 3 to 4, (battery-level) from 17 to 16
   goals met: 3 of 11
6. (visit x0y4z0)
   added: (visited x0y4z0)
   changed: (battery-level) from 16 to 15
   goals met: 4 of 11
7. (decrease_y)
   changed: (y) from 4 to 3, (battery-level) from 15 to 14
   goals met: 4 of 11
8. (decrease_y)
   changed: (y) from 3 to 2, (battery-level) from 14 to 13
   goals met: 4 of 11
9. (visit x0y2z0)
   added: (visited x0y2z0)
   changed: (battery-level) from 13 to 12
   goals met: 5 of 11
10. (decrease_y)
   changed: (y) from 2 to 1, (battery-level) from 12 to 11
   goals met: 5 of 11
11. (visit x0y1z0)
   added: (visited x0y1z0)
   changed: (battery-level) from 11 to 10
   goals met: 6 of 11
12. (increase_y)
   changed: (y) from 1 to 2, (battery-level) from 10 to 9
   goals met: 6 of 11
13. (increase_y)
   changed: (y) from 2 to 3, (battery-level) from 9 to 8
   goals met: 6 of 11
14. (increase_y)
   changed: (y) from 3 to 4, (battery-level) from 8 to 7
   goals met: 6 of 11
15. (increase_y)
   changed: (y) from 4 to 5, (battery-level) from 7 to 6
   goals met: 6 of 11
16. (visit x0y5z0)
   added: (visited x0y5z0)
   changed: (battery-level) from 6 to 5
   goals met: 7 of 11
17. (decrease_y)
   changed: (y) from 5 to 4, (battery-level) from 5 to 4
   goals met: 7 of 11
18. (decrease_y)
   changed: (y) from 4 to 3, (battery-level) from 4 to 3
   goals met: 7 of 11
19. (decrease_y)
   changed: (y) from 3 to 2, (battery-level) from 3 to 2
   goals met: 7 of 11
20. (decrease_y)
   changed: (y) from 2 to 1, (battery-level) from 2 to 1
   goals met: 7 of 11
21. (decrease_y)
   changed: (y) from 1 to 0, (battery-level) from 1 to 0
   goals met: 8 of 11
22. (recharge)
   changed: (battery-level) from 0 to 21
   goals met: 8 of 11
23. (visit x0y0z0)
   added: (visited x0y0z0)
   changed: (battery-level) from 21 to 20
   goals met: 9 of 11
24. (increase_y)
   changed: (y) from 0 to 1, (battery-level) from 20 to 19
   goals met: 8 of 11
25. (increase_y)
   changed: (y) from 1 to 2, (battery-level) from 19 to 18
   goals met: 8 of 11
26. (increase_y)
   changed: (y) from 2 to 3, (battery-level) from 18 to 17
   goals met: 8 of 11
27. (increase_y)
   changed: (y) from 3 to 4, (battery-level) from 17 to 16
   goals met: 8 of 11
28. (increase_y)
   changed: (y) from 4 to 5, (battery-level) from 16 to 15
   goals met: 8 of 11
29. (increase_y)
   changed: (y) from 5 to 6, (battery-level) from 15 to 14
   goals met: 8 of 11
30. (visit x0y6z0)
   added: (visited x0y6z0)
   changed: (battery-level) from 14 to 13
   goals met: 9 of 11
31. (increase_y)
   changed: (y) from 6 to 7, (battery-level) from 13 to 12
   goals met: 9 of 11
32. (visit x0y7z0)
   added: (visited x0y7z0)
   changed: (battery-level) from 12 to 11
   goals met: 10 of 11
33. (decrease_y)
   changed: (y) from 7 to 6, (battery-level) from 11 to 10
   goals met: 10 of 11
34. (decrease_y)
   changed: (y) from 6 to 5, (battery-level) from 10 to 9
   goals met: 10 of 11
35. (decrease_y)
   changed: (y) from 5 to 4, (battery-level) from 9 to 8
   goals met: 10 of 11
36. (decrease_y)
   changed: (y) from 4 to 3, (battery-level) from 8 to 7
   goals met: 10 of 11
37. (decrease_y)
   changed: (y) from 3 to 2, (battery-level) from 7 to 6
   goals met: 10 of 11
38. (decrease_y)
   changed: (y) from 2 to 1, (battery-level) from 6 to 5
   goals met: 10 of 11
39. (decrease_y)
   changed: (y) from 1 to 0, (battery-level) from 5 to 4
   goals met: 11 of 11
